src/InformationRegisters/КоличествоНастроекШаблоновПроцессов/КоличествоНастроекШаблоновПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоличествоНастроекШаблоновПроцессов</name>
  <resources>
    <name>КоличествоНастроек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкаШаблоновБизнесПроцессов/НастройкаШаблоновБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаШаблоновБизнесПроцессов</name>
  <resources>
    <name>ЗапрещеноИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтерактивныйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидИнтерактивногоСобытия</name>
    <type>
      <types>EnumRef.ВидыИнтерактивныхДействий</types>
    </type>
  </resources>
  <resources>
    <name>СобытияАвтоСтарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КомуНазначен</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонБизнесПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>CatalogRef.УсловияМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КоличествоНастроекШаблоновПроцессов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет данные в регистре для данного шаблона
//
// Параметры:
//  ШаблонПроцесса - ссылка на шаблон.
//
Процедура ОбновитьСведенияПоШаблону(ШаблонПроцесса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК Количество
		|ИЗ
		|	РегистрСведений.НастройкаШаблоновБизнесПроцессов КАК НастройкаШаблоновБизнесПроцессов
		|ГДЕ
		|	НастройкаШаблоновБизнесПроцессов.ШаблонБизнесПроцесса = &ШаблонБизнесПроцесса
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкаШаблоновБизнесПроцессов.ШаблонБизнесПроцесса";
		
	Запрос.УстановитьПараметр("ШаблонБизнесПроцесса", ШаблонПроцесса);	
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	
	МенеджерЗаписи = РегистрыСведений.КоличествоНастроекШаблоновПроцессов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ШаблонПроцесса = ШаблонПроцесса;
	МенеджерЗаписи.КоличествоНастроек = Выборка.Количество;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает количество настроек по шаблону.
//
// Параметры:
//  Шаблон - ссылка на шаблон
//
// Возвращаемое значение:
//  Числов
//
Функция КоличествоНастроекПоШаблону(Шаблон) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоНастроекШаблоновПроцессов.КоличествоНастроек КАК КоличествоНастроек
		|ИЗ
		|	РегистрСведений.КоличествоНастроекШаблоновПроцессов КАК КоличествоНастроекШаблоновПроцессов
		|ГДЕ
		|	КоличествоНастроекШаблоновПроцессов.ШаблонПроцесса = &ШаблонПроцесса";
	Запрос.УстановитьПараметр("ШаблонПроцесса", Шаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоНастроек;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
